# 1. Написати програму, яка виконуватиме такі операції: 1) виведення на 
# екран дільників, спільних для двох натуральних чисел; 2) виведення на екран 
# перших N чисел, кратних заданому числу. Ці операції реалізувати у вигляді 
# функцій. 


def find_delyteli(a, b):
   
    if b > a:
        c = a
        a = b
        b = c
    
    
    f = True

    
    for c in range(2, b + 1):
        if b % c == 0 and a % c == 0:
            print(c, end=" ")
            f=False
    
    if f:
        print ("Общих делителей нет")
    else:
        print()


def crat(n, a):
    for i in range(1, n + 1):
        print(a * i, end=" ")

